MikroElektronika/core_packages/PIC/XC8/def/PIC18LF24K50/mcu.h
// Register: CTMUCONH
#define CTMUCONH CTMUCONH
extern volatile unsigned char           CTMUCONH            __at(0xF8F);
#ifndef _LIB_BUILD
asm("CTMUCONH equ 0F8Fh");
#endif
// aliases
extern volatile unsigned char           CTMUCON0            __at(0xF8F);
#ifndef _LIB_BUILD
asm("CTMUCON0 equ 0F8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTTRIG                 :1;
        unsigned IDISSEN                :1;
        unsigned EDGSEQEN               :1;
        unsigned EDGEN                  :1;
        unsigned TGEN                   :1;
        unsigned CTMUSIDL               :1;
        unsigned                        :1;
        unsigned CTMUEN                 :1;
    };
    struct {
        unsigned TRIGEN                 :1;
        unsigned                        :4;
        unsigned SIDL                   :1;
        unsigned                        :1;
        unsigned ON                     :1;
    };
} CTMUCONHbits_t;
extern volatile CTMUCONHbits_t CTMUCONHbits __at(0xF8F);
// bitfield macros
#define _CTMUCONH_CTTRIG_POSN                               0x0
#define _CTMUCONH_CTTRIG_POSITION                           0x0
#define _CTMUCONH_CTTRIG_SIZE                               0x1
#define _CTMUCONH_CTTRIG_LENGTH                             0x1
#define _CTMUCONH_CTTRIG_MASK                               0x1
#define _CTMUCONH_IDISSEN_POSN                              0x1
#define _CTMUCONH_IDISSEN_POSITION                          0x1
#define _CTMUCONH_IDISSEN_SIZE                              0x1
#define _CTMUCONH_IDISSEN_LENGTH                            0x1
#define _CTMUCONH_IDISSEN_MASK                              0x2
#define _CTMUCONH_EDGSEQEN_POSN                             0x2
#define _CTMUCONH_EDGSEQEN_POSITION                         0x2
#define _CTMUCONH_EDGSEQEN_SIZE                             0x1
#define _CTMUCONH_EDGSEQEN_LENGTH                           0x1
#define _CTMUCONH_EDGSEQEN_MASK                             0x4
#define _CTMUCONH_EDGEN_POSN                                0x3
#define _CTMUCONH_EDGEN_POSITION                            0x3
#define _CTMUCONH_EDGEN_SIZE                                0x1
#define _CTMUCONH_EDGEN_LENGTH                              0x1
#define _CTMUCONH_EDGEN_MASK                                0x8
#define _CTMUCONH_TGEN_POSN                                 0x4
#define _CTMUCONH_TGEN_POSITION                             0x4
#define _CTMUCONH_TGEN_SIZE                                 0x1
#define _CTMUCONH_TGEN_LENGTH                               0x1
#define _CTMUCONH_TGEN_MASK                                 0x10
#define _CTMUCONH_CTMUSIDL_POSN                             0x5
#define _CTMUCONH_CTMUSIDL_POSITION                         0x5
#define _CTMUCONH_CTMUSIDL_SIZE                             0x1
#define _CTMUCONH_CTMUSIDL_LENGTH                           0x1
#define _CTMUCONH_CTMUSIDL_MASK                             0x20
#define _CTMUCONH_CTMUEN_POSN                               0x7
#define _CTMUCONH_CTMUEN_POSITION                           0x7
#define _CTMUCONH_CTMUEN_SIZE                               0x1
#define _CTMUCONH_CTMUEN_LENGTH                             0x1
#define _CTMUCONH_CTMUEN_MASK                               0x80
#define _CTMUCONH_TRIGEN_POSN                               0x0
#define _CTMUCONH_TRIGEN_POSITION                           0x0
#define _CTMUCONH_TRIGEN_SIZE                               0x1
#define _CTMUCONH_TRIGEN_LENGTH                             0x1
#define _CTMUCONH_TRIGEN_MASK                               0x1
#define _CTMUCONH_SIDL_POSN                                 0x5
#define _CTMUCONH_SIDL_POSITION                             0x5
#define _CTMUCONH_SIDL_SIZE                                 0x1
#define _CTMUCONH_SIDL_LENGTH                               0x1
#define _CTMUCONH_SIDL_MASK                                 0x20
#define _CTMUCONH_ON_POSN                                   0x7
#define _CTMUCONH_ON_POSITION                               0x7
#define _CTMUCONH_ON_SIZE                                   0x1
#define _CTMUCONH_ON_LENGTH                                 0x1
#define _CTMUCONH_ON_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned CTTRIG                 :1;
        unsigned IDISSEN                :1;
        unsigned EDGSEQEN               :1;
        unsigned EDGEN                  :1;
        unsigned TGEN                   :1;
        unsigned CTMUSIDL               :1;
        unsigned                        :1;
        unsigned CTMUEN                 :1;
    };
    struct {
        unsigned TRIGEN                 :1;
        unsigned                        :4;
        unsigned SIDL                   :1;
        unsigned                        :1;
        unsigned ON                     :1;
    };
} CTMUCON0bits_t;
extern volatile CTMUCON0bits_t CTMUCON0bits __at(0xF8F);
// bitfield macros
#define _CTMUCON0_CTTRIG_POSN                               0x0
#define _CTMUCON0_CTTRIG_POSITION                           0x0
#define _CTMUCON0_CTTRIG_SIZE                               0x1
#define _CTMUCON0_CTTRIG_LENGTH                             0x1
#define _CTMUCON0_CTTRIG_MASK                               0x1
#define _CTMUCON0_IDISSEN_POSN                              0x1
#define _CTMUCON0_IDISSEN_POSITION                          0x1
#define _CTMUCON0_IDISSEN_SIZE                              0x1
#define _CTMUCON0_IDISSEN_LENGTH                            0x1
#define _CTMUCON0_IDISSEN_MASK                              0x2
#define _CTMUCON0_EDGSEQEN_POSN                             0x2
#define _CTMUCON0_EDGSEQEN_POSITION                         0x2
#define _CTMUCON0_EDGSEQEN_SIZE                             0x1
#define _CTMUCON0_EDGSEQEN_LENGTH                           0x1
#define _CTMUCON0_EDGSEQEN_MASK                             0x4
#define _CTMUCON0_EDGEN_POSN                                0x3
#define _CTMUCON0_EDGEN_POSITION                            0x3
#define _CTMUCON0_EDGEN_SIZE                                0x1
#define _CTMUCON0_EDGEN_LENGTH                              0x1
#define _CTMUCON0_EDGEN_MASK                                0x8
#define _CTMUCON0_TGEN_POSN                                 0x4
#define _CTMUCON0_TGEN_POSITION                             0x4
#define _CTMUCON0_TGEN_SIZE                                 0x1
#define _CTMUCON0_TGEN_LENGTH                               0x1
#define _CTMUCON0_TGEN_MASK                                 0x10
#define _CTMUCON0_CTMUSIDL_POSN                             0x5
#define _CTMUCON0_CTMUSIDL_POSITION                         0x5
#define _CTMUCON0_CTMUSIDL_SIZE                             0x1
#define _CTMUCON0_CTMUSIDL_LENGTH                           0x1
#define _CTMUCON0_CTMUSIDL_MASK                             0x20
#define _CTMUCON0_CTMUEN_POSN                               0x7
#define _CTMUCON0_CTMUEN_POSITION                           0x7
#define _CTMUCON0_CTMUEN_SIZE                               0x1
#define _CTMUCON0_CTMUEN_LENGTH                             0x1
#define _CTMUCON0_CTMUEN_MASK                               0x80
#define _CTMUCON0_TRIGEN_POSN                               0x0
#define _CTMUCON0_TRIGEN_POSITION                           0x0
#define _CTMUCON0_TRIGEN_SIZE                               0x1
#define _CTMUCON0_TRIGEN_LENGTH                             0x1
#define _CTMUCON0_TRIGEN_MASK                               0x1
#define _CTMUCON0_SIDL_POSN                                 0x5
#define _CTMUCON0_SIDL_POSITION                             0x5
#define _CTMUCON0_SIDL_SIZE                                 0x1
#define _CTMUCON0_SIDL_LENGTH                               0x1
#define _CTMUCON0_SIDL_MASK                                 0x20
#define _CTMUCON0_ON_POSN                                   0x7
#define _CTMUCON0_ON_POSITION                               0x7
#define _CTMUCON0_ON_SIZE                                   0x1
#define _CTMUCON0_ON_LENGTH                                 0x1
#define _CTMUCON0_ON_MASK                                   0x80

// Register: CCPR2
#define CCPR2 CCPR2
extern volatile unsigned short          CCPR2               __at(0xF90);
#ifndef _LIB_BUILD
asm("CCPR2 equ 0F90h");
#endif

// Register: CCPR2L
#define CCPR2L CCPR2L
extern volatile unsigned char           CCPR2L              __at(0xF90);
#ifndef _LIB_BUILD
asm("CCPR2L equ 0F90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR2L                 :8;
    };
} CCPR2Lbits_t;
extern volatile CCPR2Lbits_t CCPR2Lbits __at(0xF90);
// bitfield macros
#define _CCPR2L_CCPR2L_POSN                                 0x0
#define _CCPR2L_CCPR2L_POSITION                             0x0
#define _CCPR2L_CCPR2L_SIZE                                 0x8
#define _CCPR2L_CCPR2L_LENGTH                               0x8
#define _CCPR2L_CCPR2L_MASK                                 0xFF

